The plan is saved for a6cf956b17e2ae7a80a87dd2e55226aacbd52639.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment
module.staging.module.nightly.sakuracloud_packet_filter.external: Refreshing state... [id=113300784461]
module.staging.module.minio.sakuracloud_packet_filter.switch: Refreshing state... [id=113300784459]
sakuracloud_internet.router: Refreshing state... [id=113300784453]
module.staging.module.beta.sakuracloud_packet_filter.external: Refreshing state... [id=113300784454]
module.staging.sakuracloud_switch.internal: Refreshing state... [id=113300784458]
module.staging.module.database.sakuracloud_packet_filter.switch: Refreshing state... [id=113300784456]
module.staging.module.minio.random_password.access_key: Refreshing state... [id=none]
module.staging.module.minio.random_password.secret_key: Refreshing state... [id=none]
module.staging.module.database.random_password.username: Refreshing state... [id=none]
module.staging.module.database.random_password.password: Refreshing state... [id=none]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # sakuracloud_internet.router is tainted, so must be replaced
-/+ resource "sakuracloud_internet" "router" {
      - enable_ipv6          = false -> null
      ~ gateway              = "153.120.80.97" -> (known after apply)
      ~ id                   = "113300784453" -> (known after apply)
      ~ ip_addresses         = [
          - "153.120.80.100",
          - "153.120.80.101",
          - "153.120.80.102",
          - "153.120.80.103",
          - "153.120.80.104",
          - "153.120.80.105",
          - "153.120.80.106",
          - "153.120.80.107",
          - "153.120.80.108",
          - "153.120.80.109",
          - "153.120.80.110",
        ] -> (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      ~ ipv6_prefix_len      = 0 -> (known after apply)
      ~ max_ip_address       = "153.120.80.110" -> (known after apply)
      ~ min_ip_address       = "153.120.80.100" -> (known after apply)
        name                 = "sos21_router"
      ~ network_address      = "153.120.80.96" -> (known after apply)
      ~ server_ids           = [] -> (known after apply)
      ~ switch_id            = "113300784455" -> (known after apply)
      - tags                 = [] -> null
        # (3 unchanged attributes hidden)
    }

  # module.staging.module.beta.data.sakuracloud_internet.router will be read during apply
  # (config refers to values not yet known)
 <= data "sakuracloud_internet" "router"  {
      + band_width           = (known after apply)
      + description          = (known after apply)
      + enable_ipv6          = (known after apply)
      + gateway              = (known after apply)
      + icon_id              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = (known after apply)
      + netmask              = (known after apply)
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + tags                 = (known after apply)
      + zone                 = "is1a"

      + filter {
          + id = (known after apply)
        }
    }

  # module.staging.module.beta.sakuracloud_disk.server_disk will be created
  + resource "sakuracloud_disk" "server_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_staging_server_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_beta",
          + "sos21_server_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.beta.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 2
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 2
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_beta",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784454"
          + upstream         = (known after apply)
          + user_ip_address  = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113300784458"
          + user_ip_address = "192.168.0.13"
        }
    }

  # module.staging.module.database.sakuracloud_disk.data_disk will be created
  + resource "sakuracloud_disk" "data_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "sos21_database_data_disk"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 20
      + tags      = [
          + "sos21_database",
          + "sos21_database_data_disk",
          + "sos21_staging",
        ]
      + zone      = "is1a"
    }

  # module.staging.module.database.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_database_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.database.sakuracloud_server.database will be created
  + resource "sakuracloud_server" "database" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_database"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_database",
          + "sos21_database_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784456"
          + upstream         = "113300784458"
          + user_ip_address  = "192.168.0.11"
        }
    }

  # module.staging.module.minio.sakuracloud_disk.data_disk will be created
  + resource "sakuracloud_disk" "data_disk" {
      + connector = "virtio"
      + id        = (known after apply)
      + name      = "sos21_minio_data_disk"
      + plan      = "ssd"
      + server_id = (known after apply)
      + size      = 20
      + tags      = [
          + "sos21_minio",
          + "sos21_minio_data_disk",
          + "sos21_staging",
        ]
      + zone      = "is1a"
    }

  # module.staging.module.minio.sakuracloud_disk.disk will be created
  + resource "sakuracloud_disk" "disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_minio_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.minio.sakuracloud_server.minio will be created
  + resource "sakuracloud_server" "minio" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_minio"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_minio",
          + "sos21_minio_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784459"
          + upstream         = "113300784458"
          + user_ip_address  = "192.168.0.12"
        }
    }

  # module.staging.module.nightly.data.sakuracloud_internet.router will be read during apply
  # (config refers to values not yet known)
 <= data "sakuracloud_internet" "router"  {
      + band_width           = (known after apply)
      + description          = (known after apply)
      + enable_ipv6          = (known after apply)
      + gateway              = (known after apply)
      + icon_id              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = (known after apply)
      + netmask              = (known after apply)
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + tags                 = (known after apply)
      + zone                 = "is1a"

      + filter {
          + id = (known after apply)
        }
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk will be created
  + resource "sakuracloud_disk" "server_disk" {
      + connector         = "virtio"
      + id                = (known after apply)
      + name              = "sos21_staging_server_disk"
      + plan              = "ssd"
      + server_id         = (known after apply)
      + size              = 20
      + source_archive_id = (known after apply)
      + tags              = [
          + "sos21_nightly",
          + "sos21_server_disk",
          + "sos21_staging",
        ]
      + zone              = "is1a"
    }

  # module.staging.module.nightly.sakuracloud_server.server will be created
  + resource "sakuracloud_server" "server" {
      + commitment        = "standard"
      + core              = 1
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 1
      + name              = "sos21_staging_server"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "sos21_nightly",
          + "sos21_server",
          + "sos21_staging",
        ]
      + zone              = "is1a"

      + network_interface {
          + mac_address      = (known after apply)
          + packet_filter_id = "113300784461"
          + upstream         = (known after apply)
          + user_ip_address  = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113300784458"
          + user_ip_address = "192.168.0.14"
        }
    }

  # module.staging.module.beta.module.nixos_archive.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = (known after apply)
          + "nixos_config"    = (known after apply)
          + "secret_contents" = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_staging_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos",
          + "sos21_beta",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/clam1n05v55w7wlbyrq012vl6fvrzh7q-sakuracloud-server-image-e2e6cf61b4c728aa3e0a7a311a26b47503eaca13874f569ceeacb44ddb13bc59.img"
      + description  = "clam1n05v55w7wlbyrq012vl6fvrzh7q-sakuracloud-server-image-e2e6cf61b4c728aa3e0a7a311a26b47503eaca13874f569ceeacb44ddb13bc59"
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_database_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_database",
          + "sos21_database",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/h3z15inn3dwnj6s972h0fmk43q667yc6-sakuracloud-server-image-f1470ccc052a2954d26d877dcf7cfa62682f91b80958dd3a91d9c9bfcf6ec854.img"
      + description  = "h3z15inn3dwnj6s972h0fmk43q667yc6-sakuracloud-server-image-f1470ccc052a2954d26d877dcf7cfa62682f91b80958dd3a91d9c9bfcf6ec854"
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_minio_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos_minio",
          + "sos21_minio",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

  # module.staging.module.nightly.module.nixos_archive.data.external.build_disk_image will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build_disk_image"  {
      + id      = (known after apply)
      + program = [
          + "flock",
          + "-x",
          + "modules/sakuracloud_archive_nixos_custom/.build.lock",
          + "modules/sakuracloud_archive_nixos_custom/build_disk_image.sh",
        ]
      + query   = {
          + "contents"        = (known after apply)
          + "nixos_config"    = (known after apply)
          + "secret_contents" = (sensitive)
        }
      + result  = (known after apply)
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos will be created
  + resource "sakuracloud_archive" "nixos" {
      + archive_file = (known after apply)
      + description  = (known after apply)
      + hash         = (known after apply)
      + id           = (known after apply)
      + name         = "sos21_staging_nixos"
      + size         = 20
      + tags         = [
          + "sos21_archive_nixos",
          + "sos21_nightly",
          + "sos21_staging",
        ]
      + zone         = "is1a"
    }

Plan: 15 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + beta_ip_address    = (known after apply)
  + nightly_ip_address = (known after apply)
Releasing state lock. This may take a few moments...
```
</details>